Robothaler/ESP32-PoolMaster/sdkconfig.defaults
# sdkconfig.defaults for ESP32-PoolMaster (ESP32-S3, Matter over Wi-Fi)
# Used only by matter_serial / matter_ota environments (framework = espidf, arduino).
# Regular arduino-only environments (serial_upload, OTA_upload) ignore this file.

# ── Target ─────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── Flash ──────────────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── PSRAM (8MB OPI/Octal) ──────────────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# Route WiFi/LwIP dynamic buffers to PSRAM (saves ~30-40KB internal RAM and matches
# the SolarControl matter_dev reference config that commissions reliably with Apple Home).
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# CORRECTED (2026-04-20): Keep CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512 ← THIS IS REQUIRED.
#   Kconfig-Semantik: malloc()-Requests KLEINER als dieser Schwellwert kommen aus
#   internem RAM, GRÖSSERE Requests werden bevorzugt nach PSRAM geroutet. Bei
#   PoolMaster (BME280, BMP180, 7 DS18B20, Nextion, AsyncMqtt, ESPAsyncWebServer,
#   WebSockets, SPIFFS, Pump-Scheduler, PoolServer etc.) saturiert der interne
#   320 KB-Heap OHNE diese Einstellung innerhalb ~20 s auf < 8 KB frei (Messung
#   aus serial-20260420_201953.log → "Heap int=5391"). Der CHIP-Task blockiert
#   dann bei BTP/PASE-Allocations → Apple-Home-Timeout 0x213.
#   Mit =512 bleibt intern ~50 KB frei, BLE/Matter-Handshake läuft wieder.
#   SolarControl kann auf den Default (=16384) verzichten, weil es bei weitem
#   nicht so viele Peripherie-Tasks/Treiber gleichzeitig hält wie PoolMaster.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512

# ── ESP32-S3 Instruction / Data Cache (do NOT use the 3.3.8 ESP-SR 32/64 KB set) ─
# S3 Bank 0 = 48KB split between I-Cache and IRAM:
#   32KB cache → 16KB IRAM  (default, leads to 100% IRAM usage with Matter)
#   16KB cache →  32KB IRAM  ← use this; SPIRAM_FETCH_INSTRUCTIONS compensates the smaller cache
# Data cache: IDF default 32 KB / 32 B line. Arduino 3.3.8 temporarily forced
# 64 KB data + 32 KB instruction cache (#12524, −49 KB SRAM); reverted in 3.3.9+.
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_32B=y

# ── Power / Brownout ──────────────────────────────────────────────────────────
CONFIG_ESP_BROWNOUT_DET=y

# ── Console / Serial ───────────────────────────────────────────────────────────
# Use UART0 instead of USB-JTAG as system console.
# Fixes crash: Brownout-ISR calls HWCDC::isConnected() → usb_serial_jtag_is_connected()
# before the USB connection monitor is initialized (null-pointer at 0x00000000).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=n

# ── Arduino compatibility ───────────────────────────────────────────────────────
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_ARDUINO_SELECTIVE_COMPILATION=y
# Disable Arduino libraries not needed by PoolMaster
# Bluetooth / radio stacks
CONFIG_ARDUINO_SELECTIVE_BLE=n
CONFIG_ARDUINO_SELECTIVE_BluetoothSerial=n
CONFIG_ARDUINO_SELECTIVE_SimpleBLE=n
CONFIG_ARDUINO_SELECTIVE_WiFiProv=n
CONFIG_ARDUINO_SELECTIVE_OpenThread=n
CONFIG_ARDUINO_SELECTIVE_Zigbee=n
# Cloud / insights
CONFIG_ARDUINO_SELECTIVE_RainMaker=n
CONFIG_ARDUINO_SELECTIVE_Insights=n
# Audio / speech
CONFIG_ARDUINO_SELECTIVE_ESP_SR=n
# HTTP (project uses AsyncMqttClient + ESPAsyncWebServer, not HTTPClient)
CONFIG_ARDUINO_SELECTIVE_HTTPClient=n
CONFIG_ARDUINO_SELECTIVE_HTTPUpdate=n
# Storage (project uses SPIFFS, not SD / FFat / LittleFS / EEPROM)
CONFIG_ARDUINO_SELECTIVE_EEPROM=n
CONFIG_ARDUINO_SELECTIVE_SD=n
CONFIG_ARDUINO_SELECTIVE_SD_MMC=n
CONFIG_ARDUINO_SELECTIVE_FFat=n
CONFIG_ARDUINO_SELECTIVE_LittleFS=n
# Networking extras not used
CONFIG_ARDUINO_SELECTIVE_Ethernet=n
CONFIG_ARDUINO_SELECTIVE_PPP=n
CONFIG_ARDUINO_SELECTIVE_AsyncUDP=n
CONFIG_ARDUINO_SELECTIVE_DNSServer=n
CONFIG_ARDUINO_SELECTIVE_NetBIOS=n
CONFIG_ARDUINO_SELECTIVE_WebServer=n

# ── FreeRTOS ───────────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── Bluetooth (NimBLE for Matter commissioning) ────────────────────────────────
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=n
# BLE advertising used by Matter for commissioning; disable after commissioned if desired
CONFIG_ENABLE_CHIPOBLE=y
# Pin BLE controller to Core 0 (WiFi runs on Core 1, see CONFIG_ESP32_WIFI_TASK_PINNED_TO_CORE_1).
# SolarControl matter_dev does the same — leaving the controller unpinned causes
# scheduling jitter on the CHIPoBLE BTP handshake (~14 s stalls observed in our logs).
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y

# ── BLE / BT controller memory reduction (prevents OOM crash on boot) ──────────
# BT controller TLSF heap ≈ 50KB base + 10KB × MAX_ACT.
# Default MAX_ACT=6 → ~110KB heap. After WiFi init the largest free internal block
# shrinks below that threshold → assert in block_locate_free → reboot loop.
# MAX_ACT=2 (1 adv + 1 connection) → ~70KB heap — comfortably fits.
CONFIG_BT_CTRL_BLE_MAX_ACT=2
# Reduce scan ADV-report and duplicate-filter caches (not needed for commissioning)
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=20
CONFIG_BT_CTRL_SCAN_DUPL_CACHE_SIZE=20

# CORRECTED (2026-04-20): Route NimBLE mbufs via DEFAULT allocator (general heap).
#   Zusammen mit CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512 landen die meisten
#   mbufs damit in PSRAM (etwas langsamer, aber OK). Ohne diese Einstellung
#   (= ALLOC_MODE_INTERNAL wurde testweise gesetzt) drückten die NimBLE-Buffer
#   zusätzlich auf den ohnehin knappen internen Heap → Matter-Commissioning
#   scheiterte weiter. Messung serial-20260420_201953.log: Heap int fiel auf
#   5391 Bytes, Long dispatch time 750 ms für Event-Type 2, 15 s CHIP-Stille,
#   dann BLE 0x213.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_DEFAULT=y

# Reduce NimBLE max connections to 1: only 1 BLE link needed for commissioning
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# ── OpenThread — disabled (Wi-Fi only, no Thread border router) ────────────────
CONFIG_OPENTHREAD_ENABLED=n
CONFIG_OPENTHREAD_RADIO_NATIVE=n

# ── Wi-Fi ──────────────────────────────────────────────────────────────────────
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_ESP32_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP32_WIFI_NAN_ENABLE=n
# Disable AMPDU RX – removes the WIFI_RX_BA_WIN >= 2*STATIC_RX_BUFFER_NUM constraint
# and allows reducing static RX buffers without a build error.
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=n
# Static RX buffers must be DMA-capable internal RAM. 10×1600=16KB (default);
# 4×1600=6.4KB is the minimum. Saves ~9.6KB of contiguous DMA-capable RAM.
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=4

# ── Matter / CHIP stack ────────────────────────────────────────────────────────
CONFIG_ESP_MATTER_NVS_USE_COMPACT_ATTR_STORAGE=y
# Move heavy work off the main CHIP event loop → shorter critical sections; helps
# Apple Home pairing when PoolMaster tasks + AsyncTCP would otherwise starve BTP.
CONFIG_ENABLE_BG_EVENT_PROCESSING=y
# CASE Sigma3 uses wall-clock for cert validity; without this, CHIP GetClock_RealTimeMS fails on ESP32.
CONFIG_ENABLE_SNTP_TIME_SYNC=y
# CHIP Device Layer platform event queue (default raised for ESP32 in connectedhomeip PR #34202).
# Too small → "Failed to post event to CHIP Platform event queue" / lambda 1000000 under load
# (esp-matter #313, #656; esp-matter release/v1.3 uses 40).
CONFIG_MAX_EVENT_QUEUE_SIZE=40

# Matter Bridge + native Solar endpoints:
#   Bridged:  Aggregator + 5 pumps = 6
#   Native:   Pool-Temp + Pool-Soll + Solar-Mode-Request = 3
#   Total:    9 → use 12 for comfortable headroom
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=12

# Matter Controller: required for PoolMaster to subscribe to SolarControl and
# send circulation/illumination commands. Client traffic is gated in
# MatterSyncTask / kCommissioningComplete (fabric>0, CHIPoBLE idle). HTTP LAN
# poll remains fallback until the first fresh Matter report arrives.
CONFIG_ESP_MATTER_CONTROLLER_ENABLE=y

# ── NVS ───────────────────────────────────────────────────────────────────────
# NVS partition (64 KB) shared between PoolMaster config (~16 KB) and Matter (~32 KB)
CONFIG_NVS_ENCRYPTION=n

# ── Stack / heap tuning ────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 20 KB CHIP task (was 16 KB) — controller subscribe + BTP/PASE share this task.
# Extra stack lives in PSRAM-capable heap.
CONFIG_CHIP_TASK_STACK_SIZE=20480
# CHIP-Task-Priorität: 7 (statt Default 1).
# PoolMaster hat ~14 FreeRTOS-Tasks, die alle mit Priority 1 auf app_cpu laufen
# (CombinedPolling, PoolMaster, TempTask, readBME280, ChlorSaltRegulation,
# pHRegulation, FlowMeasures, StatusLights, Publish-Tasks, otaTask, MatterSync,
# Arduino-Loop). Der CHIP-Event-Loop läuft unpinned, bekam bei Priority 1
# aber während Commissioning nicht genügend CPU-Zeit, um die BTP-Handshake-
# Pakete innerhalb des Apple-Home-Timeouts (15 s) zu beantworten — siehe
# logs/serial-2026*.log: nach "CHIPoBLE subscribe received" folgen 15 s
# CHIP-Silence, dann "BLE GAP terminated reason 0x213".
# Ursache: einzelne PoolMaster-Tasks können Core/Lock 3+ s blockieren
# (z.B. TempTask t_max=3609 ms bei OneWire-Konvertierung); mit gleichem
# Priority-Niveau wird CHIP dahinter einsortiert.
# Priority 7 entspricht dem NimBLE-Host-Task → kein Vorrangproblem zwischen
# BLE-Stack und Matter-Stack; PoolMaster-Tasks werden bei Commissioning-
# Events preempted.
# SolarControl läuft mit Priority 1 zuverlässig, weil es nur eine Handvoll
# Tasks hat; hier haben wir viel mehr Last auf gleichem Prio-Level.
CONFIG_CHIP_TASK_PRIORITY=7

# ── Logging ───────────────────────────────────────────────────────────────────
# Runtime default stays INFO so the serial console isn't flooded. We raise the
# compile-time MAXIMUM level to DEBUG (=4) so that detailed logs for specific
# tags (chip[DL], chip[BLE], Ble, NimBLE) can be enabled at runtime via
# esp_log_level_set() — see matterBridgeStart() in src/MatterBridge.cpp.
# This is what lets us see the CHIPoBLE TX indication path ("Sending
# indication for CHIPoBLE TX…" / "Confirm received…") during BTP handshake
# diagnosis, without bloating every other task's log output.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
# CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT is not set
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL=4

# ── mbedTLS / heap ────────────────────────────────────────────────────────────
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# HKDF required by Matter's CHIP crypto (CHIPCryptoPALmbedTLS.cpp calls mbedtls_hkdf)
CONFIG_MBEDTLS_HKDF_C=y

# ── Compiler ──────────────────────────────────────────────────────────────────
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
